---
type: VertexPositionNormalColored
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 6
tags: [revit-api, class]
---

# VertexPositionNormalColored

`Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexPositionNormalColored | 2017 | `public VertexPositionNormalColored ( XYZ position , XYZ normal , ColorWithTransparency color )` |
| Method | GetColor | 2017 | `public ColorWithTransparency GetColor ()` |
| Method | GetSizeInFloats | 2017 | `public static int GetSizeInFloats ()` |
| Method | SetColor | 2017 | `public void SetColor ( ColorWithTransparency color )` |
| Property | Normal | 2017 | `public XYZ Normal { get ; set ; }` |
| Property | Position | 2017 | `public XYZ Position { get ; set ; }` |